import React from 'react'
import './Tablepromo.css'
import deal1 from '../Assets/choose1.jpg'
import deal2 from '../Assets/choose2.jpg'
import deal3 from '../Assets/choose3.png'
import deal4 from '../Assets/choose4.jpg'
function Tablepromo() {
  return (
    <><h2>Promotion detail</h2>
    <table className='table-promo'>
      <tr>
        <th>Promotion</th>
        <th>Conditions(เงื่อนไข)</th>
      </tr>
      <tr>
        <td style={{width:'0%'}}><img src={deal1} style={{ width: '150px', height: '150px' }} alt="" /></td>
        <td><h3>ชื่อโปรโมชั่น: Shabu Time 20%  </h3><p>+ โปรโมชั่นนี้ใช้ได้เฉพาะเวลา 11:00-13:00 น. เท่านั้น และใช้ได้ทุกวันภายในเวลากิจกรร</p>
<p>+ โปรโมชั่นนี้ใช้ได้กับทุกสาขาที่เข้าร่วม</p>
<p>+ โปรโมชั่นนี้ไม่สามารถนำมาแลก เปลี่ยน ทอนเป็นเงินสด หรือโอนสิทธิ์ให้ผู้อื่นได้</p>
<p>+ โปรโมชั่นนี้ไม่สามารถใช้ร่วมกับโปรโมชั่นอื่นได้</p>
<p>+ ทางบริษัทขอสงวนสิทธิ์ในการเปลี่ยนแปลงเงื่อนไขของโปโมชั้นโดยไม่แจ้งให้ทราบล่วงหน้า</p></td>
      </tr>
      <tr>
        <td><img src={deal2} style={{ width: '150px', height: '150px' }} alt="" /></td>
        <td><h3>ชื่อโปรโมชั่น: Come 4 Pay 3  </h3><p>+ โปรโมชั่นนี้ใช้ได้ต่อเนื่องโดยไม่จำกัดจำนวนครั้ง</p>
<p>+ โปรโมชั่นนี้ใช้ได้กับทุกสาขาเฉพาะเท่านั้น</p>
<p>+ โปรโมชั่นนี้ไม่สามารถนำมาแลก เปลี่ยน ทอนเป็นเงินสด หรือโอนสิทธิ์ให้ผู้อื่นได้</p>
<p>+ โปรโมชั่นนี้ไม่สามารถใช้ร่วมกับโปรโมชั่นอื่นได้</p>
<p>+ ทางบริษัทขอสงวนสิทธิ์ในการเปลี่ยนแปลงเงื่อนไขของโปรโมชั้นโดยไม่แจ้งให้ทราบล่วงหน้า</p></td>
      </tr>
      <tr>
        <td><img src={deal3} style={{ width: '150px', height: '150px' }} alt="" /></td>
        <td><h3>ชื่อโปรโมชั่น: Birthday 50%  </h3><p>+ โปรโมชั่นนี้ใช้ได้เฉพาะกับเจ้าของวันเกิดเพียง 1 ท่านเท่านั้น</p>
<p>+ โปรโมชั่นนี้ใช้ได้กับทุกสาขาที่เข้าร่วม</p>
<p>+ โปรโมชั่นนี้ไม่สามารถนำมาแลก เปลี่ยน ทอนเป็นเงินสด หรือโอนสิทธิ์ให้ผู้อื่นได้</p>
<p>+ โปรโมชั่นนี้ไม่สามารถใช้ร่วมกับโปรโมชั่นอื่นได้หากมาเพียง 1 ท่านหรือมากับท่านที่มีวันเกิดตรงกัน</p>
<p>+ ทางบริษัทขอสงวนสิทธิ์ในการเปลี่ยนแปลงเงื่อนไขของโปรโมชั้นโดยไม่แจ้งให้ทราบล่วงหน้า</p></td>
      </tr>
      <tr>
        <td><img src={deal4} style={{ width: '150px', height: '150px' }} alt="" /></td>
        <td><h3>ชื่อโปรโมชั่น: Special Day 100 Baht  </h3><p>+ โปรโมชั่นนี้ใช้ได้เฉพาะวันที่ 30 กุมภาพันธ์ 2567 เท่านั้</p>
<p>+ โปรโมชั่นนี้ใช้ได้กับทุกสาขาที่เข้าร่วม</p>
<p>+ โปรโมชั่นนี้ไม่สามารถนำมาแลก เปลี่ยน ทอนเป็นเงินสด หรือโอนสิทธิ์ให้ผู้อื่นได้</p>
<p>+ โปรโมชั่นนี้ไม่สามารถใช้ร่วมกับโปรโมชั่นอื่นได้</p>
<p>+ ทางบริษัทขอสงวนสิทธิ์ในการเปลี่ยนแปลงเงื่อนไขของโปรโมชั้นโดยไม่แจ้งให้ทราบล่วงหน้า</p></td>
      </tr>
    </table></>
  )
}

export default Tablepromo